import { NextApiRequest, NextApiResponse } from 'next';

export default function handler(req: NextApiRequest, res: NextApiResponse) {
  const cities = [
    {
      id: 1,
      name: 'Балашиха',
    },
    {
      id: 2,
      name: 'Быково',
    },
    {
      id: 3,
      name: 'Видное',
    },
    {
      id: 4,
      name: 'Воскресенск',
    },
    {
      id: 5,
      name: 'Дедовск',
    },
    {
      id: 6,
      name: 'Дзержинский',
    },
    {
      id: 7,
      name: 'Дмитров',
    },
    {
      id: 8,
      name: 'Долгопрудный',
    },
    {
      id: 9,
      name: 'Домодедова',
    },
    {
      id: 10,
      name: 'Дрожжино',
    },
    {
      id: 11,
      name: 'Дубна',
    },
    {
      id: 12,
      name: 'Егорьевск',
    },
    {
      id: 13,
      name: 'Железнодорожный',
    },
    {
      id: 14,
      name: 'Жуковский',
    },
    {
      id: 15,
      name: 'Зарайск',
    },
    {
      id: 16,
      name: 'Зеленоград',
    },
    {
      id: 17,
      name: 'Истра',
    },
    {
      id: 18,
      name: 'Климовск',
    },
    {
      id: 19,
      name: 'Клин',
    },
    {
      id: 20,
      name: 'Коломна',
    },
    {
      id: 21,
      name: 'Королев',
    },
    {
      id: 22,
      name: 'Красково',
    },
    {
      id: 23,
      name: 'Красногорск',
    },
    {
      id: 24,
      name: 'Краснознаменск',
    },
    {
      id: 25,
      name: 'Лобня',
    },
    {
      id: 26,
      name: 'Луховицы',
    },
    {
      id: 27,
      name: 'Лыткарино',
    },
    {
      id: 28,
      name: 'Люберцы',
    },
    {
      id: 29,
      name: 'Мисайлово',
    },
    {
      id: 30,
      name: 'Молоково',
    },
    {
      id: 31,
      name: 'Москва',
    },
    {
      id: 32,
      name: 'Московский',
    },
    {
      id: 33,
      name: 'Мытища',
    },
    {
      id: 34,
      name: 'Наро-Фоминс',
    },
    {
      id: 35,
      name: 'Ногинск',
    },
    {
      id: 36,
      name: 'Одинцово',
    },
    {
      id: 37,
      name: 'Орехово-Зуево',
    },
    {
      id: 38,
      name: 'Павловский Посад',
    },
    {
      id: 39,
      name: 'Подольск',
    },
    {
      id: 40,
      name: 'Протвино',
    },
    {
      id: 41,
      name: 'Пушкино',
    },
    {
      id: 42,
      name: 'Раменское',
    },
    {
      id: 43,
      name: 'Руетово',
    },
    {
      id: 44,
      name: 'Сергиев Посад',
    },
    {
      id: 45,
      name: 'Серпухово',
    },
    {
      id: 46,
      name: 'Солнечногорск',
    },
    {
      id: 47,
      name: 'Ступино',
    },
    {
      id: 48,
      name: 'Тарычево',
    },
    {
      id: 49,
      name: 'Томилино',
    },
    {
      id: 50,
      name: 'Троицк',
    },
    {
      id: 51,
      name: 'Фрязино',
    },
    {
      id: 52,
      name: 'Химки',
    },
    {
      id: 53,
      name: 'Чехов',
    },
    {
      id: 54,
      name: 'Щелково',
    },
    {
      id: 55,
      name: 'Щербинка',
    },
    {
      id: 56,
      name: 'Электросталь',
    },
  ];
  res.status(200).json(cities);
}
