export const footerNavData = [
  {
    navHeader: 'каталог',
    navContent: [
      {
        name: 'Товары для кошек',
        url: '',
      },
      {
        name: 'Товары для собак',
        url: '',
      },
      {
        name: 'Защита от блох и клещей',
        url: '',
      },
      {
        name: 'Товары для грызунов и хорьков',
        url: '',
      },
      {
        name: 'Товары для черепах и рептилий',
        url: '',
      },
      {
        name: 'Товары для птиц',
        url: '',
      },
      {
        name: 'Ветаптека',
        url: '',
      },
      {
        name: 'Выбор корма по породе',
        url: '',
      },
      {
        name: 'Выбор корма по заболеваниям',
        url: '',
      },
      {
        name: 'Выбор корма по вкусам',
        url: '',
      },
    ],
  },
  {
    navHeader: 'покупателям',
    navContent: [
      {
        name: 'Акции',
        url: '',
      },
      {
        name: 'Бренды',
        url: '',
      },
      {
        name: 'Бонусная программа',
        url: '',
      },
      {
        name: 'Как купить',
        url: '',
      },
      {
        name: 'Доставка и оплата',
        url: '',
      },
      {
        name: 'Возврат товара',
        url: '',
      },
    ],
  },
  {
    navHeader: 'сервисы',
    navContent: [
      {
        name: 'Подписка на доставку',
        url: '',
      },
      {
        name: 'Подбор корма',
        url: '',
      },
      {
        name: 'Сравнение кормов',
        url: '',
      },
      {
        name: 'Партнерская программа',
        url: '',
      },
      {
        name: 'Статьи',
        url: '',
      },
      {
        name: 'Груминг',
        url: '',
      },
      {
        name: 'Ветаптека',
        url: '',
      },
    ],
  },
  {
    navHeader: 'компания',
    navContent: [
      {
        name: 'Новости',
        url: '',
      },
      {
        name: 'Магазины',
        url: '',
      },
      {
        name: 'О нас',
        url: '',
      },
      {
        name: 'Вакансии',
        url: '',
      },
      {
        name: 'Тендеры',
        url: '',
      },
    ],
  },
];
export const copyRightList = [
  { name: '© 2023 Зоомагазин «Четыре Лапы»', url: '' },
  { name: 'Пользовательское соглашение', url: '' },
  { name: 'Политика конфиденциальности', url: '' },
];
